'''
Напишите программу, которая считывает два целых числа A и B и выводит
наибольшее значение из них. Числа — целые от 1 до 1000.

Формат ввода
Вводятся два числа.

Формат вывода
Выведите ответ на задачу.
'''
#Ответ:
A = int(input())
B = int(input())
if A > B:
    print(A)
else:
    print(B)
