'''
Заданное число N записали 100 раз подряд и затем возвели в квадрат. Что
получилось?

Формат ввода
Вводится целое неотрицательное число N не превышающее 1000.

Формат вывода
Выведите ответ на задачу.
'''
#Ответ:
N = input()
K = int(N * 100)
print(K * K)
