'''
Дано положительное двузначное число. Найдите число десятков в нем.

Формат ввода
Вводится единственное число (гарантируется, что оно соответствует условию задачи).

Формат вывода
Выведите ответ на задачу.
'''
#Ответ:
n = int(input())
print(n // 10)
